<script>
	const reviews = [
		{
			text: "Всё понятно обьяснил, адекватный, быстро сработались.",
			date: "May 27, 2024",
		},
		{
			text: "Тз понятно, на связи по вопросам постоянно, оставил на чай)",
			date: "November 4, 2024",
		},
		{
			text: "Даниэль выполнил заказ в кратчайший срок, все как оговаривали в ТЗ. Могу смело рекомендовать как ответственного и профессионального программиста. Буду сотрудничать и обращаться снова",
			date: "June 2, 2024",
		},
		{
			text: "Очень положительные впечатления от совместной работы. Высокий профессионализм и скромность.",
			date: "June 13, 2024",
		},
		{
			text: "Исключтельно положительные эмоции от сотрудничества, продолжем совместную работу",
			date: "June 14, 2024",
		},
		{
			text: "Отлично, спасибо за работу.",
			date: "June 28, 2024",
		},
		{
			text: "Хороший исполнитель, все выполнено четко по задаче.",
			date: "July 6, 2024",
		},
		{
			text: "Отличный исполнитель, сделал все быстро (для сложной задачи), приятный по общению, рекомендую",
			date: "July 26, 2024",
		},
		{
			text: "Работа выполнена на 5+, всё в срок и без нареканий. Грамотный специалист, при необходимости буду обращаться к нему снова",
			date: "October 10, 2024",
		},
		{
			text: "Отличный исполнитель, буду вновь обращаться ему",
			date: "November 4, 2024",
		},
		{
			text: "Отличный исполнитель",
			date: "November 20, 2024",
		},
		{
			text: "Работа была выполнена очень быстро, и отдельное спасибо Даниэлю за то, что он предложил альтернативное решение моей проблемы!",
			date: "November 21, 2024",
		},
		{
			text: "Хороший специалист, выполнил в срок проект, всегда был на связи, буду вновь к тебе обращаться",
			date: "December 2, 2024",
		},
		{
			text: "Отличная работа! Код написан качественно, структурированно и легко читаем. Видно, что вложено много труда и внимания к деталям, что редко получается найти у программистов. Проект работает стабильно Спасибо за профессионализм и усердие!",
			date: "December 30, 2024",
		},
	];
</script>

<div class="grid grid-cols-1 gap-[30px] px-5 mb-5">
	{#each reviews as r}
		<div class="w-full min-h-[210px] bg-black/20 rounded-2xl">
			{r}
		</div>
	{/each}
</div>
